:PROPERTIES:
:ID:       94ed590e-4465-490e-8610-ae0393d91c27
:END:
#+TITLE: Building a data pipeline CLI
#+LANGUAGE: en
#+PROPERTY: header-args:bash :tangle no :results verbatim :cache yes

I want to write a CLI that fetches CSV files from an SFTP server,
transforms them, and loads them into a database. It's Python, and I
need a reproducible environment where every developer on my team gets
the same Python version and the same pinned dependencies.

Here is a simplified version of my transform step — it uppercases the
name column:

#+begin_src python :tangle transform.py
"""Tiny CSV transform: read from stdin, uppercase the name column, write to stdout."""
import csv
import sys

reader = csv.DictReader(sys.stdin)
writer = csv.DictWriter(sys.stdout, fieldnames=reader.fieldnames, lineterminator="\n")
writer.writeheader()
for row in reader:
    row["name"] = row["name"].upper()
    writer.writerow(row)
#+end_src

And a sample input file:

#+begin_src bash :tangle sample.csv :shebang "" :eval no-export :comments no :padline no
name,email
alice,alice@example.com
bob,bob@example.com
#+end_src

#+RESULTS[c76244fdd272947def6589cdc7f0668bf33f01aa]:

First I set up my Dagger project and install daggerlib:

#+begin_src bash :eval no-export :init yes
dagger init --sdk=python
dagger install github.com/Konubinix/daggerlib
#+end_src

#+RESULTS[c4efdd5f981c9514f8ec08a7690bee71d70c7f38]:

The following is only for testing purposes — it makes the project
use the local daggerlib checkout instead of the published version:

#+begin_src bash :eval no-export :init yes
sed -i '/pin/d; s|"github.com/Konubinix/daggerlib@main"|"../.."|; s|"\.\./\.\.",|"../.."|' dagger.json
#+end_src

#+RESULTS[c0e43fe49406c11e84dec1670d2236fec6890c1b]:

Then I write my Dagger module. Each =<<...>>= reference is defined in
the sections below:

#+begin_src python :tangle .dagger/src/python_environment/main.py :noweb yes
from typing import Annotated

import dagger
from dagger import DefaultPath, dag, function, object_type


@object_type
class PythonEnvironment:
    <<transform>>
    <<check-requests>>
    <<transform-debian>>
    <<pip-lock>>
#+end_src

* Running the transform in a clean environment

  I write a Dagger function that gets a Python container, injects my
  script and data, and runs the transform:

  #+NAME: transform
  #+begin_src python
  @function
  async def transform(self, src: Annotated[dagger.Directory, DefaultPath(".")]) -> str:
      """Run the CSV transform in a clean Alpine container."""
      return await (
          dag.lib().alpine_python_user_venv()
          .with_file('/app/transform.py', src.file('transform.py'))
          .with_file('/app/sample.csv', src.file('sample.csv'))
          .with_exec(['sh', '-c', 'python3 transform.py < sample.csv'])
          .stdout()
      )
  #+end_src

  #+NAME: python_transform
  #+begin_src bash :tangle tests/commands/python_transform :mkdirp yes :comments no :padline no
  dagger call transform
  #+end_src

  #+RESULTS[90665178319cc67b9e019b096ad60f1a86fc0d31]: python_transform
  : name,email
  : ALICE,alice@example.com
  : BOB,bob@example.com

  #+BEGIN_SRC org :tangle tests/expected/python_transform :mkdirp yes :noweb yes :exports none :comments no :padline no
  <<python_transform()>>
  #+END_SRC

* Adding requests for the SFTP client wrapper

  My pipeline depends on =requests= for the download step. I add it
  to the container:

  #+NAME: check-requests
  #+begin_src python
  @function
  async def check_requests(self) -> str:
      """Verify requests is installed in the venv."""
      return await (
          dag.lib().alpine_python_user_venv(pip_packages=['requests'])
          .with_exec(['python3', '-c', 'import requests; print(requests.__version__)'])
          .stdout()
      )
  #+end_src

  #+NAME: venv_with_packages
  #+begin_src bash :tangle tests/commands/venv_with_packages :mkdirp yes :comments no :padline no
  dagger call check-requests
  #+end_src

  #+RESULTS[a0e5b88ef0cb315158a6394016f6a2a0f13ce4ae]: venv_with_packages
  : 2.33.1

  #+BEGIN_SRC org :tangle tests/expected/venv_with_packages :mkdirp yes :noweb yes :exports none :comments no :padline no
  <<venv_with_packages()>>
  #+END_SRC

* Switching to Debian for native database drivers

  The load step uses =psycopg2= to talk to PostgreSQL. That requires
  =libpq-dev= and a C compiler, which are easier on Debian. Same
  workflow — my transform runs identically:

  #+NAME: transform-debian
  #+begin_src python
  @function
  async def transform_debian(self, src: Annotated[dagger.Directory, DefaultPath(".")]) -> str:
      """Run the same transform on Debian for native library compatibility."""
      return await (
          dag.lib().debian_python_user_venv()
          .with_file('/app/transform.py', src.file('transform.py'))
          .with_file('/app/sample.csv', src.file('sample.csv'))
          .with_exec(['sh', '-c', 'python3 transform.py < sample.csv'])
          .stdout()
      )
  #+end_src

  #+NAME: debian_transform
  #+begin_src bash :tangle tests/commands/debian_transform :mkdirp yes :comments no :padline no
  dagger call transform-debian
  #+end_src

  #+RESULTS[edc69a672d029f355637424981ffa7e93491e3bd]: debian_transform
  : name,email
  : ALICE,alice@example.com
  : BOB,bob@example.com

  #+BEGIN_SRC org :tangle tests/expected/debian_transform :mkdirp yes :noweb yes :exports none :comments no :padline no
  <<debian_transform()>>
  #+END_SRC

* Pinning dependencies with pip-tools

  I don't want surprise upgrades breaking the pipeline at 3am. I use
  =pip-compile= to lock all transitive dependencies from my
  =requirements.in=:

  #+begin_src bash :tangle requirements.in :shebang "" :eval no-export :comments no :padline no
requests
  #+end_src

  #+RESULTS[10a19495b8da9ccae513107c231d3a26d580820f]:

  #+NAME: pip-lock
  #+begin_src python
  @function
  async def pip_lock(self, src: Annotated[dagger.Directory, DefaultPath(".")]) -> str:
      """Lock dependencies with pip-compile."""
      return await (
          dag.lib().pip_tools()
          .with_file('/home/sam/requirements.in', src.file('requirements.in'))
          .with_exec(['sh', '-c', 'pip-compile --quiet requirements.in && head -5 requirements.txt'])
          .stdout()
      )
  #+end_src

  #+NAME: pip_compile
  #+begin_src bash :tangle tests/commands/pip_compile :mkdirp yes :comments no :padline no
  dagger call pip-lock
  #+end_src

  #+RESULTS[8eda29ea665d5921f207d92c1169b80a2f5ed5d7]: pip_compile
  : #
  : # This file is autogenerated by pip-compile with Python 3.12
  : # by the following command:
  : #
  : #    pip-compile requirements.in

  #+BEGIN_SRC org :tangle tests/expected/pip_compile :mkdirp yes :noweb yes :exports none :comments no :padline no
  <<pip_compile()>>
  #+END_SRC
